In [1]:
import pandas as pd 
data=pd.Series([2,3,4,5,],index=['a','b','c','d']) #in pandas we give our own index and 
#it works like a dictionary in python
data.values
type(data.values) #this is a numpy.ndarray
type(data) #pandas object
data.index
data['b']

3

In [3]:
data['a':'c'] #here thec final index included

a    2
b    3
c    4
dtype: int64

In [4]:
grades_dict={'a':4,'b':5,'c':2.5,'d':6}
grades=pd.Series(grades_dict)
grades.values

array([4. , 5. , 2.5, 6. ])

In [5]:
marks_dict={'a':80,'b':97,'c':82,'d':90}
marks=pd.Series(marks_dict)
marks[0:2] #but here the second index is not included

a    80
b    97
dtype: int64

In [6]:
marks

a    80
b    97
c    82
d    90
dtype: int64

In [7]:
grades

a    4.0
b    5.0
c    2.5
d    6.0
dtype: float64

In [8]:
d=pd.DataFrame({"marks":marks,"grades":grades})
d

a    80
b    97
c    82
d    90
Name: marks, dtype: int64

In [9]:
#to tran spose the above
d.T

           a     b     c     d
marks   80.0  97.0  82.0  90.0
grades   4.0   5.0   2.5   6.0

In [10]:
d.values

array([[80. ,  4. ],
       [97. ,  5. ],
       [82. ,  2.5],
       [90. ,  6. ]])

In [11]:
d.values[2,1]
d.columns

Index(['marks', 'grades'], dtype='object')

In [12]:
d["scaledmarks"]=100*(d['marks']/90) #for deleting the column we use del 
d
del d["scaledmarks"]
d

   marks  grades
a     80     4.0
b     97     5.0
c     82     2.5
d     90     6.0

In [13]:
b=d[d['marks']>90]
b

   marks  grades
b     97     5.0

In [14]:
a=pd.DataFrame([{'a':45,'b':12},{'a':8,'b':22,'c':31}])
a
a.fillna(5)
a.dropna

<bound method DataFrame.dropna of     a   b     c
0  45  12   NaN
1   8  22  31.0>

In [15]:
a=pd.Series(['a','b','c'],index=[1,5,3])
a[5]
a[1:5] #it does not take the first value
a.loc[1:3] #print the total series
a.iloc[1:3]

5    b
3    c
dtype: object

In [16]:
d

   marks  grades
a     80     4.0
b     97     5.0
c     82     2.5
d     90     6.0

In [17]:
d.iloc[3,:]

marks     90.0
grades     6.0
Name: d, dtype: float64

In [18]:
d.iloc[::-1,:]

   marks  grades
d     90     6.0
c     82     2.5
b     97     5.0
a     80     4.0